System.org
#+title: System Configuration With Flakes
#+property: header-args :mkdirp yes
#+property: header-args :noweb yes :results silent
#+property: header-args:emacs-lisp :tangle .emacs.d/init.el

* Table of Contents (ToC)
:PROPERTIES:
:TOC:      :include all :force (depth) :ignore (this) :local (depth)
:END:
:CONTENTS:
- [[#system-configuration][System Configuration]]
  - [[#flakenix][flake.nix]]
    - [[#stable-packages][stable packages]]
    - [[#nixos][nixos]]
    - [[#home-manager][home manager]]
    - [[#packages][packages]]
    - [[#overlays][overlays]]
  - [[#nixos][nixos]]
    - [[#general][general]]
    - [[#re-expose-nixpkgs][re-expose nixpkgs]]
    - [[#users][users]]
    - [[#machines][machines]]
      - [[#wheeler][wheeler]]
        - [[#general][general]]
        - [[#disks][disks]]
        - [[#clickpad][clickpad]]
        - [[#networking][networking]]
        - [[#laptop-specific][laptop-specific]]
      - [[#hopper][hopper]]
        - [[#general][general]]
        - [[#disks][disks]]
        - [[#networking][networking]]
  - [[#emacs][emacs]]
    - [[#install-emacs][install emacs]]
  - [[#environment][environment]]
    - [[#exwm][exwm]]
    - [[#todo-screen-locking][todo screen locking]]
      - [[#slock][slock]]
      - [[#xss-lock][xss-lock]]
    - [[#misc][misc]]
      - [[#keyboard][keyboard]]
  - [[#network][network]]
    - [[#networkmanager][networkmanager]]
    - [[#gnupg][gnupg]]
  - [[#sound][sound]]
  - [[#services][services]]
    - [[#syncthing][syncthing]]
    - [[#screen-brightness][screen brightness]]
  - [[#browsers][browsers]]
  - [[#todo-mail-setup][todo mail setup]]
  - [[#applications][applications]]
    - [[#automount-with-udiskie][automount with udiskie]]
    - [[#zathura][zathura]]
    - [[#mpv][mpv]]
    - [[#vim-backup-editor][vim (backup editor)]]
    - [[#terminal][terminal]]
      - [[#shell-zsh][shell (zsh)]]
    - [[#git][git]]
    - [[#todo-desktop-various-needs-sorting][todo desktop various (needs sorting)]]
- [[#emacs-configuration][Emacs Configuration]]
  - [[#startup-performance][Startup Performance]]
  - [[#prerequisites-and-machine-specifics][Prerequisites and Machine Specifics]]
  - [[#package-management][Package Management]]
  - [[#native-compilation][Native Compilation]]
  - [[#keeping-your-system-clean][Keeping Your System Clean]]
  - [[#update-load-path][Update Load Path]]
  - [[#server-mode][Server-mode]]
  - [[#desktop][Desktop]]
  - [[#ui][UI]]
    - [[#basic][Basic]]
    - [[#themes][Themes]]
    - [[#font][Font]]
    - [[#modeline][Modeline]]
    - [[#auto-reverting-changed-files][Auto-Reverting Changed Files]]
    - [[#rainbow-coloured-parentheses][Rainbow Coloured Parentheses]]
    - [[#highlight-matching-braces][Highlight Matching Braces]]
    - [[#set-default-browser-in-emacs][Set default browser in Emacs]]
    - [[#pinentry][Pinentry]]
  - [[#window-management][Window Management]]
    - [[#frame-scaling--zooming][Frame Scaling / Zooming]]
  - [[#evil-centered-keyboard-configuration][Evil Centered Keyboard Configuration]]
    - [[#general][General]]
    - [[#evil][Evil]]
    - [[#which-key][Which-key]]
    - [[#extra-keybindings][Extra keybindings]]
  - [[#editing-configuration][Editing Configuration]]
    - [[#tab-widths-and-spaces-for-indentation][Tab Widths and Spaces For Indentation]]
    - [[#commenting-lines][Commenting Lines]]
    - [[#automatically-clean-whitespace][Automatically clean whitespace]]
  - [[#file-management][File-Management]]
    - [[#dired][Dired]]
      - [[#key-bindings][Key Bindings]]
        - [[#navigation][Navigation]]
        - [[#marking-files][Marking files]]
        - [[#copying-and-renaming-files][Copying and Renaming files]]
        - [[#deleting-files][Deleting files]]
        - [[#creating-and-extracting-archives][Creating and extracting archives]]
        - [[#other-common-operations][Other common operations]]
      - [[#configuration][Configuration]]
  - [[#development][Development]]
    - [[#productivity][Productivity]]
      - [[#syntax-checking-with-flycheck][Syntax checking with Flycheck]]
      - [[#snippets][Snippets]]
    - [[#projectile][Projectile]]
    - [[#magit][Magit]]
    - [[#languages][Languages]]
      - [[#ide-features-with-lsp-mode][IDE Features with lsp-mode]]
        - [[#lsp-mode][lsp-mode]]
        - [[#lsp-ui][lsp-ui]]
        - [[#lsp-treemacs][lsp-treemacs]]
      - [[#better-completions-with-company-mode][Better Completions with Company Mode]]
      - [[#debugging-with-dap-mode][Debugging with dap-mode]]
      - [[#eglot-as-language-server][Eglot as language server]]
      - [[#markdown][Markdown]]
      - [[#nix][Nix]]
      - [[#python][Python]]
      - [[#rust][Rust]]
      - [[#scheme][Scheme]]
  - [[#completion-framework][Completion Framework]]
    - [[#vertico][Vertico]]
    - [[#marginalia][Marginalia]]
    - [[#consult][Consult]]
  - [[#org-mode][Org Mode]]
    - [[#org-ui][Org UI]]
    - [[#configuration][Configuration]]
    - [[#note-testing-new-workflow][NOTE TESTING NEW WORKFLOW]]
      - [[#file-paths][File paths]]
      - [[#workflow-states][Workflow states]]
      - [[#tags][Tags]]
      - [[#agenda][Agenda]]
      - [[#capture-templates][Capture templates]]
      - [[#new-workflow][New Workflow]]
    - [[#modules][Modules]]
    - [[#babel][Babel]]
    - [[#block-templates][Block Templates]]
    - [[#org-bullets-using-superstar][Org Bullets using Superstar]]
    - [[#archiving-made-easier---function][Archiving Made Easier - Function]]
    - [[#update-table-of-contents-on-save][Update Table of Contents on Save]]
    - [[#end-of-use-package-org][End of use-package org]]
  - [[#org-journal][Org Journal]]
  - [[#sync-google-calendar][Sync Google Calendar]]
  - [[#presentations-with-org-re-reveal][Presentations with org-re-reveal]]
  - [[#useful-packages-and-apps][Useful Packages and Apps]]
    - [[#app-launcher][App Launcher]]
    - [[#deft-note-taking][Deft (note taking)]]
    - [[#erc-chat][ERC (chat)]]
      - [[#connect-automatically-with-c-c-c][Connect automatically with C-c c]]
      - [[#basic-configuration][Basic Configuration]]
      - [[#jumping-irc-buffers-easily][Jumping IRC Buffers Easily]]
      - [[#colorize-nicks][Colorize Nicks]]
      - [[#display-inline-images][Display Inline Images]]
    - [[#expand-region][Expand Region]]
    - [[#helpful][Helpful]]
    - [[#mail][Mail]]
    - [[#notifications][Notifications]]
    - [[#text-scaling-using-hydra][Text Scaling using Hydra]]
  - [[#terminals][Terminals]]
    - [[#eshell][Eshell]]
      - [[#configuration][Configuration]]
      - [[#toggling-eshell][Toggling Eshell]]
    - [[#vterm][Vterm]]
  - [[#password-management][Password Management]]
  - [[#system-utilities][System Utilities]]
    - [[#daemons][Daemons]]
    - [[#proced][Proced]]
  - [[#runtime-performance][Runtime Performance]]
  - [[#inspiration][Inspiration]]
- [[#dotfile-helper-scripts][Dotfile Helper Scripts]]
:END:

* System Configuration

** flake.nix

the following goes into flake.nix

#+begin_src nix :tangle ./flake.nix :noweb no-export :padline no
  #
  # this file is auto-generated from "system.org"
  #
  {
    description = "my packages and nixos/home-manager configurations";

    inputs = {
      nixpkgs = {
        type = "github";
        owner = "nixos";
        repo = "nixpkgs";
        ref = "nixpkgs-unstable";
      };

      <<flake-inputs>>
    };

    outputs = { self, ... }@inputs:
      let
        # flakes are evaluated hermetically, thus are unable to access
        # host environment (including looking up current system).
        #
        # that's why flakes must explicitly export sets for each system
        # supported.
        systems = ["x86_64-linux"];

        # genAttrs applies f to all elements of a list of strings, and
        # returns an attrset { name -> result }
        #
        # useful for generating sets for all systems or hosts.
        genAttrs = list: f: inputs.nixpkgs.lib.genAttrs list f;

        # generate pkgs set for each system. this takes into account my
        # nixpkgs config (allowUnfree) and my overlays.
        pkgsBySystem =
          let mkPkgs = system: import inputs.nixpkgs {
                inherit system;
                overlays = self.overlays.${system};
                config = { allowUnfree = true; };
              };
          in genAttrs systems mkPkgs;

        # genHosts takes an attrset { name -> options } and calls mkHost
        # with options+name. the result is accumulated into an attrset
        # { name -> result }.
        #
        # used in nixos and home manager configurations.
        genHosts = hosts: mkHost:
          genAttrs (builtins.attrNames hosts) (name: mkHost ({ inherit name; } // hosts.${name}));

        # merges a list of attrsets into a single attrset
        mergeSections = inputs.nixpkgs.lib.foldr inputs.nixpkgs.lib.mergeAttrs {};

      in mergeSections [
        <<flake-outputs-nixos>>
        <<flake-outputs-home-manager>>
        <<flake-outputs-packages>>
        <<flake-outputs-overlays>>
      ];
  }

#+end_src

=Nix flakes= are still an experimental feature, so you need the following in nixos configuration to enable it.

#+begin_src nix :noweb-ref nixos-section
  {
    nix = {
      package = pkgs.nixFlakes;
      extraOptions = ''
        experimental-features = nix-command flakes ca-references
      '';
    };
  }
#+end_src

*** stable packages

For packages that are broken in nixpkgs-unstable, expose the latest stable channel as ~pkgs.stable~.
So first, let's add this to the input and flake-overlays.

#+begin_src nix :noweb-ref flake-inputs
  nixpkgs-stable = {
    type = "github";
    owner = "nixos";
    repo = "nixpkgs";
    ref = "nixos-21.05";
  };
#+end_src

#+begin_src nix :noweb-ref flake-overlays
  (final: prev: {
    stable = import inputs.nixpkgs-stable {
      inherit system;
      overlays = self.overlays.${system};
      config = { allowUnfree = true; };
    };
  })
#+end_src

*** nixos

Here, we expose our =Nixos= configurations. =Wheeler= is my main laptop, =Hopper= my desktop machine.

#+begin_src nix :noweb-ref flake-outputs-nixos
  (let
    nixosHosts = {
      wheeler = { system = "x86_64-linux";  config = ./nixos-config.nix; };

      # i'll use the same configuration file for hopper, because the configuration
      # details are mostly the same. let's see if this works.
      hopper = { system = "x86_64-linux";  config = ./nixos-config.nix; };
    };

    mkNixosConfiguration = { name, system, config }:
      let pkgs = pkgsBySystem.${system};
      in inputs.nixpkgs.lib.nixosSystem {
        inherit system;
        modules = [
          { nixpkgs = { inherit pkgs; }; }
          (import config)
        ];
        specialArgs = { inherit name inputs; };
      };

  in {
    nixosConfigurations = genHosts nixosHosts mkNixosConfiguration;
  })
#+end_src

*** home manager

Add =home-manager= to flake inputs...

#+begin_src nix :noweb-ref flake-inputs
  home-manager = {
    type = "github";
    owner = "rycee";
    repo = "home-manager";
    ref = "master";
    inputs.nixpkgs.follows = "nixpkgs";
  };
#+end_src

... and expose =home-manager= configurations.

#+begin_src nix :noweb-ref flake-outputs-home-manager
  (let
    homeManagerHosts = {
      markBroeders = {
        system = "x86_64-linux";
        config = ./home.nix;
        username = "mark";
        homeDirectory = "/home/mark";
      };
    };

    mkHomeManagerConfiguration = { system, name, config, username, homeDirectory }:
      let pkgs = pkgsBySystem.${system};
      in inputs.home-manager.lib.homeManagerConfiguration {
        inherit system pkgs username homeDirectory;
        configuration = { ... }: {
          nixpkgs.config.allowUnfree = true;
          nixpkgs.config.firefox.enableTridactylNative = true;
          nixpkgs.overlays = self.overlays.${system};
          imports = [
            self.lib.home-manager-common

            (import config)
          ];
        };
      };

  in {
    # re-export common home-manager configuration to be reused between
    # nixos module and standalone home-manager config.
    lib.home-manager-common = { lib, pkgs, config, ... }: {
      imports = [
        <<home-manager-section>>
      ];
      # home.stateVersion = "20.09";
      home.stateVersion = "21.03";
    };
    homeManagerConfigurations = genHosts homeManagerHosts mkHomeManagerConfiguration;
  })
#+end_src

Finally, integrate the =home-manager= module into nixos.

#+begin_src nix :noweb-ref nixos-section
  {
    imports = [inputs.home-manager.nixosModules.home-manager];
    home-manager = {
      useUserPackages = true;
      useGlobalPkgs = true;
      users.mark = inputs.self.lib.home-manager-common;
    };
  }
#+end_src

*** packages

Generate packages set for each supported system.

#+begin_src nix :noweb-ref flake-outputs-packages
  (let
    mkPackages = system:
      let
        pkgs = pkgsBySystem.${system};
      in
        mergeSections [
          <<flake-packages>>
        ];

  in {
    packages = genAttrs systems mkPackages;
  })
#+end_src

*** overlays

And generate overlays for all supported systems.

#+begin_src nix :noweb-ref flake-outputs-overlays
  (let
    mkOverlays = system: [
      # mix-in all local packages, so they are available as pkgs.${packages-name}
      (final: prev: self.packages.${system})

      <<flake-overlays>>
    ];
  in {
    overlays = genAttrs systems mkOverlays;
  })
#+end_src

** nixos
*** general

I'm a [[http://nixos.org/][nixos]] user. what's cool about it is that i can describe all my system configuration in one file (almost). i can execute a single command and have a system with the same software, system settings, etc.

An outline of configuration looks like this:

#+begin_src nix :tangle ./nixos-config.nix :noweb no-export :padline no
  #
  # this file is auto-generated from "system.org"
  #
  { name, config, pkgs, lib, inputs, ... }:
  let
    machine-config = lib.getAttr name {
      wheeler = [
        <<machine-wheeler>>
      ];
      hopper = [
        <<machine-hopper>>
      ];
    };

  in
  {
    imports = [
      {
        nixpkgs.config.allowUnfree = true;

        # the nixos release to be compatible with for stateful data such as databases.
        system.stateVersion = "21.05";
      }

      <<nixos-section>>
    ] ++ machine-config;
  }
#+end_src

this =<<nixos-section>>= is replaced by other parts of this doc.

*** re-expose nixpkgs

#+begin_src nix :noweb-ref nixos-section
  {
    # for compatibility with nix-shell, nix-build, etc.
    environment.etc.nixpkgs.source = inputs.nixpkgs;
    nix.nixPath = ["nixpkgs=/etc/nixpkgs"];

    # register self and nixpkgs as flakes for quick access
    nix.registry = {
      self.flake = inputs.self;

      nixpkgs.flake = inputs.nixpkgs;
    };
  }
#+end_src

Same, but for home manager–managed host.

#+begin_src nix :noweb-ref home-manager-section
  {
    home.file."nixpkgs".source = inputs.nixpkgs;
    systemd.user.sessionVariables.NIX_PATH = lib.mkForce "nixpkgs=$home/nixpkgs\${NIX_PATH:+:}$NIX_PATH";

    xdg.configFile."nix/registry.json".text = builtins.toJSON {
      version = 2;
      flakes = [
        {
          from = { id = "self"; type = "indirect"; };
          to = ({
            type = "path";
            path = inputs.self.outPath;
          } // lib.filterAttrs
            (n: v: n == "lastModified" || n == "rev" || n == "revCount" || n == "narHash")
            inputs.self);
        }
        {
          from = { id = "nixpkgs"; type = "indirect"; };
          to = ({
            type = "path";
            path = inputs.nixpkgs.outPath;
          } // lib.filterAttrs
            (n: v: n == "lastModified" || n == "rev" || n == "revCount" || n == "narHash")
            inputs.nixpkgs);
        }
      ];
    };
  }
#+end_src

