System.org
*** todo desktop various (needs sorting)

~<<home-manager-section>>~

#+begin_src nix :noweb-ref home-manager-section
  {
    home.packages = [
      pkgs.dunst             # keep me posted!
      pkgs.polybar           # what to do without a panel
      pkgs.feh               # background
      pkgs.udiskie

      # media
      pkgs.playerctl         # mainly for polybar script

      # work
      pkgs.mu                # mail
      pkgs.remmina           # rdp

      # other
      pkgs.pass              # password manager

      pkgs.vim
      pkgs.git
      pkgs.stow
    ];

    # texlive
    programs.texlive = {
      enable = true;
      extraPackages = tpkgs: {
        inherit (tpkgs)
          scheme-medium
          capt-of
          wrapfig;
      };
    };
  }
#+end_src

* Emacs Configuration

This is my personal Emacs configuration, mostly based upon the [[https://github.com/daviwil/emacs-from-scratch][emacs-from-scratch]] video series made by [[https://github.com/daviwil][David Wilson]]. Of course, his is not the only configuration that I checked out, there are so many great configurations to discover on the net. I try to give credit where credit is due, but I might have forgotten some.

** Startup Performance

Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.

#+begin_src emacs-lisp
  
  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))
  
  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))
  
#+end_src

** TODO Prerequisites and Machine Specifics

Check if I'm using GuixSD (requires =emacs-f= from =AUR= on ~Arch Linux~ or =app-emacs/f= for ~gentoo~).

#+begin_src emacs-lisp
  (setq mb/is-guix-system (and (eq system-type 'gnu/linux)
                               (require 'f)
                               (string-equal (f-read "/etc/issue")
                                             "\nThis is the GNU system.  Welcome.\n")))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  f
#+end_src

** Package Management

There are various tools you could use for managing which packages are installed and how these are configured. Emacs by definition comes with a [[https://www.emacswiki.org/emacs/InstallingPackages][simple package manager]]. One of the most used alternatives is [[https://github.com/jwiegley/use-package][use-package]], which is a macro that makes it easier to configure your packages. I choose to use [[https://github.com/jwiegley/use-package][straight.el]] for package management. So far I've noticed, it's easy to setup, allows for extensive yet easy customization and works great.

#+begin_src emacs-lisp
  
  (defvar native-comp-deferred-compilation-deny-list ())
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  
  ;; Use straight.el for use-package expressions
  (straight-use-package 'use-package)
  
  ;; Always use straight to install on systems other than Guix
  ;;(setq straight-use-package-by-default (not (eq mb/is-guix-system 't)))
  
  ;; Always use straight to install on systems other than Linux
  (setq straight-use-package-by-default (not (eq system-type 'gnu/linux)))
  ;; Load the helper package for commands like `straight-x-clean-unused-repos'
  (require 'straight-x)
  
#+end_src

*nix packages*

#+begin_src nix :noweb-ref emacs-melpa
  use-package
#+end_src

** Native Compilation

Trying out emacs native compilation.

#+begin_src emacs-lisp
  
  (setq native-comp-async-report-warnings-errors nil)
  
#+end_src

** Keeping Your System Clean

Emacs has a tendency to create a lot of backup files which can /pollute/ your folders. There are some things you can do about this. One of the things I use, is a package called [[https://github.com/emacscollective/no-littering][no-littering]].

#+begin_src emacs-lisp
  
  ;; NOTE: If you want to move everything out of the ~/.emacs.d folder
  ;; reliably, set `user-emacs-directory` before loading no-littering!
  (setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
        url-history-file     (expand-file-name "url/history" user-emacs-directory))
  
  (use-package no-littering
    :straight t)
  
  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  
  ;; Emacs saves all customizations in init.el by default. I prefer
  ;; to keep the customizations in a seperate file
  (setq custom-file (no-littering-expand-etc-file-name "custom.el"))
  
#+end_src

** Update Load Path

This is the folder which among others contains the desktop library.

#+begin_src emacs-lisp
  
  (push "~/.dotfiles/.emacs.d/lisp" load-path)
  
#+end_src

** Server-mode

Start the Emacs server from this instance so that all =emacsclient= calls are routed here.

#+begin_src emacs-lisp
  
  (server-start)
  
#+end_src

** Desktop

Load up the desktop environment if on a machine that supports it and the --use-exwm argument was passed to Emacs on startup. Desktop environment and window management code can be found in Desktop.org.

#+begin_src emacs-lisp
  (setq mb/exwm-enabled (eq window-system 'x))

  (when mb/exwm-enabled
    (require 'mb-desktop))
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  epkgs.exwm
  desktop-environment
#+end_src

** UI
*** Basic

Set some personal information

#+begin_src emacs-lisp
  
  (setq user-full-name "Mark Broeders"
        user-mail-address "mail@markBroeders.nl")
  
#+end_src

Clean up Emacs' user interface, make it more minimal.

#+begin_src emacs-lisp
  
  ;; Thanks, but no thanks
  (setq inhibit-startup-message t)
  
  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (menu-bar-mode -1)            ; Disable the menu bar
  (tooltip-mode -1)           ; Disable tooltips
  
  (set-fringe-mode 10)       ; Give some breathing room
  
  ;; Set up the visible bell
  (setq visible-bell t)
  
#+end_src

Improve scrolling.

#+begin_src emacs-lisp
  
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
  (setq scroll-step 1) ;; keyboard scroll one line at a time
  (setq use-dialog-box nil) ;; Disable dialog boxes since they weren't working in Mac OSX
  
#+end_src

Set frame transparency and maximize windows by default.

#+begin_src emacs-lisp
  
  (set-frame-parameter (selected-frame) 'alpha '(92 . 92))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  
#+end_src

Enable line numbers and customize their format.

#+begin_src emacs-lisp
  
  (global-display-line-numbers-mode t)
  (column-number-mode)
  
  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  org-agenda-mode-hook
                  term-mode-hook
                  erc-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  vterm-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  
#+end_src

Don't warn for following symlinked files

#+begin_src emacs-lisp
  
  (setq vc-follow-symlinks t)
  
#+end_src

Be more granular with undo

#+begin_src emacs-lisp
  
  (setq evil-want-fine-undo t)
  
#+end_src

Replace "yes" or "No" questions with "y" or "n"

#+begin_src emacs-lisp
  
  (fset 'yes-or-no-p 'y-or-n-p)
  
#+end_src

*** Themes

I really like the [[https://github.com/hlissner/emacs-doom-themes][Doom themes collection]], especially =vibrant= and =palenight=. For now, lets go with the former. Note that the function =doom-themes-visual-bell-config= enables flashing the mode-line on error.

#+begin_src emacs-lisp
  
  (use-package doom-themes
    :init
    (load-theme 'doom-palenight t)
    (doom-themes-visual-bell-config))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  doom-themes
#+end_src

*** Font

Different platforms need different default font sizes; [[https://mozilla.github.io/Fira/][Fira Mono]] was my favorite face, but I'm trying out =Jetbrains Mono= atm.

#+begin_src emacs-lisp
  
  ;; Set the font face based on platform
  (set-face-attribute 'default nil
                      :font "JetBrains Mono"
                      :weight 'light
                      :height 115)
  
  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil
                      :font "JetBrains Mono"
                      :weight 'light
                      :height 115)
  
  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil
                      :font "Cantarell"
                      ;;:font "Iosevka Aile"
                      :height 135
                      :weight 'light)
  
#+end_src

*** Modeline

For modeline customization there is =Doom Modeline= which allows for extensive [[https://github.com/seagle0128/doom-modeline#customize][customization]]. Below is a pretty basic configuration. It does however require the installation of all-the-icons font: =M-x all-the-icons-install-fonts=.

#+begin_src emacs-lisp
  
  (use-package all-the-icons)
  
  (use-package doom-modeline
    :after eshell
    :init
    (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 20)
    (doom-modeline-bar-width 6)
    (doom-modeline-major-mode-icon nil))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  doom-modeline
    all-the-icons
#+end_src

