System.org
*** Auto-Reverting Changed Files

#+begin_src emacs-lisp
  
  ;; Revert Dired and other buffers
  (setq global-auto-revert-non-file-buffers t)
  
  ;; Revert buffers when the underlying file has changed
  (global-auto-revert-mode 1)
  
#+end_src

*** Rainbow Coloured Parentheses

#+begin_src emacs-lisp
  
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
  
  ;; (use-package smartparens
  ;;   :hook (prog-mode . smartparens-mode))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  smartparens
    rainbow-delimiters
#+end_src

*** Highlight Matching Braces

#+begin_src emacs-lisp
  
  (use-package paren
    :config
    (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
    (show-paren-mode 1))
  
#+end_src

*** Set default browser in Emacs

#+begin_src emacs-lisp
  (setq browse-url-browser-function 'browse-url-generic
        browse-url-generic-program "qutebrowser")
#+end_src

*** Pinentry

Emacs can be prompted for the PIN of GPG private keys, we just need to set
=epa-pinentry-mode= to accomplish that:

#+begin_src emacs-lisp
  
  (use-package pinentry)
  (setq epa-pinentry-mode 'loopback)
  (pinentry-start)
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-elpa
  pinentry
#+end_src

*NOTE* Also install pinentry-emacs!

** Window Management

*** Frame Scaling / Zooming

The keybindings for this are =C+M+-= and =C+M+==.

#+begin_src emacs-lisp
  
  (use-package default-text-scale
    :defer 1
    :config
    (default-text-scale-mode))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  default-text-scale
#+end_src

** Evil Centered Keyboard Configuration

Although not as experienced as most people, I started out with vim. Although my switch to =Emacs= wasn't that bad (I never experienced an /Emacs pinky/), I still mostly prefer the [[https://vim.rtorr.com/][Vim keybindings]]. So, [[https://github.com/emacs-evil/evil][Evil]] to the rescue!

First, make =escape= quit prompts

#+begin_src emacs-lisp
  
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  
#+end_src

Since I let =evil-mode= take over =C-u= for buffer scrolling, I need to re-bind the =universal-argument= command to another key sequence.  I'm choosing =C-M-u= for this purpose.

#+begin_src emacs-lisp
  
  (global-set-key (kbd "C-M-u") 'universal-argument)
  
#+end_src

*** General

[[https://github.com/noctuid/general.el][General.el]] is a fantastic package that makes it very easy to create keybindings. One of the things I enjoyed from [[https://github.com/hlissner/doom-emacs][Doom Emacs]] was the =spacebar= as =leader-key=. In this little configuration snippet, I create a function which defines my leader key. This function makes it easy to create keybindings in my config. Note that my main leader-key is =SPC=, however, for easy configuration of extra keybindings I define a second one =C-c=.

#+begin_src emacs-lisp
  
  (use-package general
    :after evil
    :config
  
    (general-create-definer mb/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
  
    (general-create-definer mb/local-leader-keys
      :prefix "C-c"))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  general
#+end_src

*** Evil

Evil emulates the keybindings in Emacs and allows for extensive [[https://evil.readthedocs.io/en/latest/index.html][customization]]. Below is a pretty standard and simple configuration. Since =Evil= does not cover all the parts of Emacs, we use an extra package called [[https://github.com/emacs-evil/evil-collection][evil-collection]] which is a collection of additional keybindings for these parts that are not covered by Evil.

#+begin_src emacs-lisp
  
  (use-package undo-tree
    :init
    (global-undo-tree-mode 1))
  
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
  
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    ;; Same for up/down keys
    (define-key evil-normal-state-map (kbd "<down>") 'evil-next-visual-line)
    (define-key evil-normal-state-map (kbd "<up>") 'evil-previous-visual-line)
  
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
  
  (use-package evil-collection
    :after evil
    :init
    (setq evil-collection-company-use-tng nil)  ;; Is this a bug in evil-collection?
    :config
    (evil-collection-init))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  evil
    evil-collection  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-elpa
  undo-tree
#+end_src

*** Which-key

[[https://github.com/justbur/emacs-which-key][Which-key]] is great for getting an overview of what keybindings are available
based on the prefix keys you entered. I set the delay quite low to 0.3 seconds. Increase this time to wait longer for the popup window.

#+begin_src emacs-lisp
  
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  which-key
#+end_src

*** Extra keybindings

Some extra keybindings which I'm quite used to:
- Bind =C-c a= to org-agenda
- Bind =C-c c= to org-capture
- Use =M-return= to open =ansi-term=
- Open ~mu4e~ with =C-c m=
- Create a 'toggle' prefix

#+begin_src emacs-lisp
  
  (mb/local-leader-keys
    "a"   '(org-agenda          :which-key "Open org-agenda")
    "c"   '(org-capture         :which-key "Capture item")
  
    "m"   '(mu4e                :which-key "Open mail")
    )
  
  (mb/leader-key-def
    ;; APPLICATIONS
    "a"  '(:ignore t   :which-key "Applications")
  
    "d"   '(:ignore t           :which-key "deft")
    "d d" '(deft                :which-key "deft")
    "d f" '(deft-find-file      :which-key "find file")
    "d n" '(deft-new-file-named :which-key "new file")
  
    "j"  '(:ignore t                             :which-key "Journal")
    "jj" '(org-journal-new-entry                 :which-key "New entry")
    "jo" '(org-journal-open-current-journal-file :which-key "Open current")
  
    ;; GTD / ORG FILES
    "o"    '(:ignore t :which-key "Open file")
    "o b"  '((lambda () (interactive)
               (find-file "~/Documents/org/gtd/books.org"))    :which-key "Books.org")
    "o i"  '((lambda () (interactive)
               (find-file "~/Documents/org/gtd/inbox.org"))    :which-key "Inbox.org")
    "o n"  '((lambda () (interactive)
               (find-file "~/Documents/org/gtd/main.org"))     :which-key "Notes.org")
    "o p"  '((lambda () (interactive)
               (find-file "~/Documents/org/gtd/projects.org")) :which-key "Projects.org")
  
    ;; TOGGLES
    "t"  '(:ignore t   :which-key "Toggles")
    )
  
#+end_src

** Editing Configuration
*** Tab Widths and Spaces For Indentation

Default to an indentation size of 2 spaces since it's the norm for pretty much every language I use.

#+begin_src emacs-lisp
  
  (setq-default tab-width 2)
  (setq-default evil-shift-width tab-width)
  
#+end_src

And use spaces for indentation instead of the default tabs.

#+begin_src emacs-lisp
  
  (setq-default indent-tabs-mode nil)
  
#+end_src

*** Commenting Lines

[[https://github.com/emacsmirror/evil-nerd-commenter][Evil-nerd-commenter]] makes it much more efficient to comment lines out. See their Github for examples of practical usage.

#+begin_src emacs-lisp
  
  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  evil-nerd-commenter
#+end_src

*** Automatically clean whitespace

#+begin_src emacs-lisp
  
  (use-package ws-butler
    :hook ((text-mode . ws-butler-mode)
           (prog-mode . ws-butler-mode)))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  ws-butler
#+end_src

** File-Management
*** Dired

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html][Dired]] is a built-in file manager for Emacs that does some pretty amazing things! I copied the next part from the emacs-from-scratch config, because it is so helpful. Here are some key bindings you should try out:

**** Key Bindings

***** Navigation

*Emacs* / *Evil*
- =n= / =j= - next line
- =p= / =k= - previous line
- =j= / =J= - jump to file in buffer
- =RET= - select file or directory
- =^= - go to parent directory
- =S-RET= / =g O= - Open file in "other" window
- =M-RET= - Show file in other window without focusing (previewing files)
- =g o= (=dired-view-file=) - Open file but in a "preview" mode, close with =q=
- =g= / =g r= Refresh the buffer with =revert-buffer= after changing configuration (and after filesystem changes!)

***** Marking files

- =m= - Marks a file
- =u= - Unmarks a file
- =U= - Unmarks all files in buffer
- =* t= / =t= - Inverts marked files in buffer
- =% m= - Mark files in buffer using regular expression
- =*= - Lots of other auto-marking functions
- =k= / =K= - "Kill" marked items (refresh buffer with =g= / =g r= to get them back)
- Many operations can be done on a single file if there are no active marks!

***** Copying and Renaming files

- =C= - Copy marked files (or if no files are marked, the current file)
- Copying single and multiple files
- =U= - Unmark all files in buffer
- =R= - Rename marked files, renaming multiple is a move!
- =% R= - Rename based on regular expression: =^test= , =old-\&=

*Power command*: =C-x C-q= (=dired-toggle-read-only=) - Makes all file names in the buffer editable directly to rename them!  Press =Z Z= to confirm renaming or =Z Q= to abort.

***** Deleting files

- =D= - Delete marked file
- =d= - Mark file for deletion
- =x= - Execute deletion for marks
- =delete-by-moving-to-trash= - Move to trash instead of deleting permanently

***** Creating and extracting archives

- =Z= - Compress or uncompress a file or folder to (=.tar.gz=)
- =c= - Compress selection to a specific file
- =dired-compress-files-alist= - Bind compression commands to file extension

***** Other common operations

- =T= - Touch (change timestamp)
- =M= - Change file mode
- =O= - Change file owner
- =G= - Change file group
- =S= - Create a symbolic link to this file
- =L= - Load an Emacs Lisp file into Emacs

