.emacs.d/init.el

;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

;; (use-package smartparens
;;   :hook (prog-mode . smartparens-mode))

(use-package paren
  :config
  (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
  (show-paren-mode 1))

(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "qutebrowser")

(use-package pinentry)
(setq epa-pinentry-mode 'loopback)
(pinentry-start)

(use-package default-text-scale
  :defer 1
  :config
  (default-text-scale-mode))

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(global-set-key (kbd "C-M-u") 'universal-argument)

(use-package general
  :after evil
  :config

  (general-create-definer mb/leader-key-def
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (general-create-definer mb/local-leader-keys
    :prefix "C-c"))

(use-package undo-tree
  :init
  (global-undo-tree-mode 1))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  ;; Same for up/down keys
  (define-key evil-normal-state-map (kbd "<down>") 'evil-next-visual-line)
  (define-key evil-normal-state-map (kbd "<up>") 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :init
  (setq evil-collection-company-use-tng nil)  ;; Is this a bug in evil-collection?
  :config
  (evil-collection-init))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(mb/local-leader-keys
  "a"   '(org-agenda          :which-key "Open org-agenda")
  "c"   '(org-capture         :which-key "Capture item")

  "m"   '(mu4e                :which-key "Open mail")
  )

(mb/leader-key-def
  ;; APPLICATIONS
  "a"  '(:ignore t   :which-key "Applications")

  "d"   '(:ignore t           :which-key "deft")
  "d d" '(deft                :which-key "deft")
  "d f" '(deft-find-file      :which-key "find file")
  "d n" '(deft-new-file-named :which-key "new file")

  "j"  '(:ignore t                             :which-key "Journal")
  "jj" '(org-journal-new-entry                 :which-key "New entry")
  "jo" '(org-journal-open-current-journal-file :which-key "Open current")

  ;; GTD / ORG FILES
  "o"    '(:ignore t :which-key "Open file")
  "o b"  '((lambda () (interactive)
             (find-file "~/Documents/org/gtd/books.org"))    :which-key "Books.org")
  "o i"  '((lambda () (interactive)
             (find-file "~/Documents/org/gtd/inbox.org"))    :which-key "Inbox.org")
  "o n"  '((lambda () (interactive)
             (find-file "~/Documents/org/gtd/main.org"))     :which-key "Notes.org")
  "o p"  '((lambda () (interactive)
             (find-file "~/Documents/org/gtd/projects.org")) :which-key "Projects.org")

  ;; TOGGLES
  "t"  '(:ignore t   :which-key "Toggles")
  )

(setq-default tab-width 2)
(setq-default evil-shift-width tab-width)

(setq-default indent-tabs-mode nil)

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package ws-butler
  :hook ((text-mode . ws-butler-mode)
         (prog-mode . ws-butler-mode)))
