System.org
**** Configuration

#+begin_src emacs-lisp
  
  (use-package dired
    :straight nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))
  
  (use-package dired-single
    :commands (dired dired-jump))
  
  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))
  
  (use-package dired-open
    :commands (dired dired-jump)
    :config
    ;; Doesn't work as expected!
    ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    (setq dired-open-extensions '(("png" . "feh")
                                  ("pdf" . "zathura")
                                  ("mkv" . "mpv"))))
  
  (use-package dired-hide-dotfiles
    :straight t
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  dired-single
    dired-hacks-utils
    all-the-icons-dired
#+end_src

** Development
*** Productivity
**** Syntax checking with Flycheck

#+begin_src emacs-lisp
  
  (use-package flycheck
    :defer t
    :hook (lsp-mode . flycheck-mode))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  flycheck
#+end_src

**** Snippets

See [[https://github.com/joaotavora/yasnippet][github]] for more info.

#+begin_src emacs-lisp
  
  (use-package yasnippet
    ;; Disabled, because I'm using it globally
    ;; :hook (prog-mode . yas-minor-mode)
    :config
    (setq yas-snippet-dirs '("~/Development/emacs-projects/snippets"))
    (yas-global-mode 1)
    (yas-reload-all))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  yasnippet
    yasnippet-snippets
#+end_src

*** Projectile

#+begin_src emacs-lisp
  
  (use-package projectile
    :config (projectile-mode)
    :demand t
    :init
    (setq projectile-project-search-path (list "~/Development/"
                                               "~/Documents/org/notes/")))
  
  (mb/leader-key-def
    "p"   '(:ignore t                  :which-key "Projectile")
    "pf"  'projectile-find-file
    "pp"  'projectile-switch-project
    "pF"  'consult-ripgrep
    "pd"  'projectile-dired)
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  projectile
    ripgrep
#+end_src

*** Magit

https://magit.vc/manual/magit/

#+begin_src emacs-lisp
  
  (use-package magit
    :bind
    ("C-x g" . magit)
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  magit
#+end_src

*** Languages
**** IDE Features with lsp-mode
***** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp
  
  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))
  
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))
  
#+end_src

***** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp
  
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))
  
#+end_src

***** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp :tangle no
  
  (use-package lsp-treemacs
    :after lsp)
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  lsp-mode
    lsp-ui
    lsp-treemacs
#+end_src

**** Better Completions with Company Mode

#+begin_src emacs-lisp
  
  (use-package company
    :after lsp-mode
    :hook (prog-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  company
#+end_src

**** Debugging with dap-mode

*NOTE* Disabled for the moment as I'm trying out =eglot=

[[https://emacs-lsp.github.io/dap-mode/][dap-mode]] is an excellent package for bringing rich debugging capabilities to Emacs via the [[https://microsoft.github.io/debug-adapter-protocol/][Debug Adapter Protocol]]. You should check out the [[https://emacs-lsp.github.io/dap-mode/page/configuration/][configuration docs]] to learn how to configure the debugger for your language.  Also make sure to check out the documentation for the debug adapter to see what configuration parameters are available to use for your debug templates!

#+begin_src emacs-lisp :tangle no
  
  (use-package dap-mode
    ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    ;; :config
    ;; (dap-ui-mode 1)
  
    :config
    ;; Set up Node debugging
    (require 'dap-node)
    (dap-node-setup) ;; Automatically installs Node debug adapter if needed
  
    ;; Bind `C-c l d` to `dap-hydra` for easy access
    (general-define-key
     :keymaps 'lsp-mode-map
     :prefix lsp-keymap-prefix
     "d" '(dap-hydra t :wk "debugger")))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  dap-mode
#+end_src

**** Eglot as language server

*NOTE* Disabled as I'm having some difficulties with getting rust to work properly. Therefore back to =lsp-mode=.

[[https://github.com/joaotavora/eglot][Eglot]] is an alternative to =lsp-mode=. Check the documentation to find out [[https://github.com/joaotavora/eglot#connecting][which servers]] =eglot= can connect to out of the box. =Eglot= does not come with default keybindings, but you can easily bind stuff to certain [[https://github.com/joaotavora/eglot#commands][eglot commands]].

#+begin_src emacs-lisp :tangle no
  
  (use-package eglot
    :straight t)
  
#+end_src

**** Markdown

#+begin_src emacs-lisp
  
  (use-package markdown-mode
    :straight t
    :mode "\\.md\\'"
    :config
    (setq markdown-command "marked")
    (defun mb/set-markdown-header-font-sizes ()
      (dolist (face '((markdown-header-face-1 . 1.2)
                      (markdown-header-face-2 . 1.1)
                      (markdown-header-face-3 . 1.0)
                      (markdown-header-face-4 . 1.0)
                      (markdown-header-face-5 . 1.0)))
        (set-face-attribute (car face) nil :weight 'normal :height (cdr face))))
  
    (defun mb/markdown-mode-hook ()
      (mb/set-markdown-header-font-sizes))
  
    (add-hook 'markdown-mode-hook 'mb/markdown-mode-hook))
  
#+end_src

**** Nix

#+begin_src emacs-lisp
  
  (use-package nix-mode
    :straight t
    :mode "\\.nix\\'")
  
#+end_src

**** Python

We use =lsp-mode= and =dap-mode= to provide a more complete development environment for Python in Emacs.  Check out [[https://emacs-lsp.github.io/lsp-mode/page/lsp-pyls/][the =pyls= configuration]] in the =lsp-mode= documentation for more details.

Make sure you have the =pyls= language server installed before trying =lsp-mode=!

#+begin_src sh :tangle no
  
  pip install --user "python-language-server[all]"
  
#+end_src

There are a number of other language servers for Python so if you find that =pyls= doesn't work for you, consult the =lsp-mode= [[https://emacs-lsp.github.io/lsp-mode/page/languages/][language configuration documentation]] to try the others!

#+begin_src emacs-lisp
  
  (use-package python-mode
    :hook (python-mode . lsp-deferred)
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    (python-shell-interpreter "python3")
    (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python))
  
#+end_src

You can use the pyvenv package to use =virtualenv= environments in Emacs.  The =pyvenv-activate= command should configure Emacs to cause =lsp-mode= and =dap-mode= to use the virtual environment when they are loaded, just select the path to your virtual environment before loading your project.

#+begin_src emacs-lisp
  
  (use-package pyvenv
    :config
    (pyvenv-mode 1))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  pyvenv
#+end_src

**** Rust

[[https://github.com/brotzeit/rustic#straight][Rustic]] is a fork of [[https://github.com/rust-lang/rust-mode][rust-mode]]. For now, I copied the config from [[https://robert.kra.hn/posts/2021-02-07_rust-with-emacs/#rustic][here]], but I will update this in the future to my liking.

#+begin_src emacs-lisp
  
  (use-package rustic
    :straight t
    :config
    (setq lsp-rust-analyzer-server-command '("~/.bin/rust-analyzer"))
    ;; comment to disable rustfmt on save
    (setq rustic-format-on-save t))
  
#+end_src

**** Scheme

#+begin_src emacs-lisp
  
  ;; Include .sld library definition files
  (use-package scheme-mode
    :straight nil
    :mode "\\.sld\\'")
  
  (use-package geiser
    :straight t
    :config
    ;; (setq geiser-default-implementation 'gambit)
    (setq geiser-default-implementation 'guile)
    (setq geiser-active-implementations '(gambit guile))
    (setq geiser-repl-default-port 44555) ; For Gambit Scheme
    (setq geiser-implementations-alist '(((regexp "\\.scm$") gambit)
                                         ((regexp "\\.sld") gambit))))
#+end_src

