System.org
** Completion Framework

There are many packages which provide completion frameworks, such as =ivy= and =helm=. Recently, I started using =vertico=, =consult=, =marginalia= and others. These are somewhat /smaller/ since they are built upon basic functionality that Emacs already provides. It is important to have =ripgrep= installed as this is notably faster than standar =grep=.

*** Vertico

[[https://github.com/minad/vertico][Vertico]] is a relatively new package created by Minad which displays a minimalistic vertical compeletion UI. It is builts further upon the built-in functionality that Emacs provides. This makes it different from [[https://github.com/abo-abo/swiper][Ivy]] which is a complete generic completion system. Therefore, we have to custimize it a bit further. Below is the basic config as taken from github.

#+begin_src emacs-lisp
  
  ;; Enable vertico
  (use-package vertico
    :straight '(vertico :host github
                        :repo "minad/vertico"
                        :branch "main")
    :init
    (vertico-mode)
  
    ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
    ;; (setq vertico-cycle t)
    )
  
  ;; Use the `orderless' completion style.
  ;; Enable `partial-completion' for files to allow path expansion.
  ;; You may prefer to use `initials' instead of `partial-completion'.
  (use-package orderless
    :straight t
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles . (partial-completion))))))
  
  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
    :init
    (savehist-mode))
  
#+end_src

*** Marginalia

[[https://github.com/minad/marginalia][Marginalia]] provides rich annotations. It is made by the same person who developed =Vertico= and many other useful packages. Marginalia for instance shows extra useful information in the minibuffer.

#+begin_src emacs-lisp
  
  ;; Enable richer annotations using the Marginalia package
  (use-package marginalia
    :after vertico
    :straight t
    ;; Either bind `marginalia-cycle` globally or only in the minibuffer
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle))
  
    ;; The :init configuration is always executed (Not lazy!)
    :init
  
    ;; Must be in the :init section of use-package such that the mode gets
    ;; enabled right away. Note that this forces loading the package.
    (marginalia-mode))
  
#+end_src

*** Consult

#+begin_src emacs-lisp
  ;; Consult
  (use-package consult
    :straight t ;; Install with straight
    ;; Replace bindings. Lazily loaded due by `use-package'.
    :bind (;; C-c bindings (mode-specific-map)
           ;; C-x bindings (ctl-x-map)
           ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
           ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
           ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
           ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
           ;; Isearch integration
           ("C-s" . consult-line)
           :map isearch-mode-map
           ("M-e" . consult-isearch)                 ;; orig. isearch-edit-string
           ("M-s e" . consult-isearch)               ;; orig. isearch-edit-string
           ("M-s l" . consult-line))                 ;; required by consult-line to detect isearch
  
    ;; Enable automatic preview at point in the *Completions* buffer.
    ;; This is relevant when you use the default completion UI,
    ;; and not necessary for Selectrum, Vertico etc.
    :hook (completion-list-mode . consult-preview-at-point-mode)
  
    ;; The :init configuration is always executed (Not lazy)
    :init
  
    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0
          register-preview-function #'consult-register-format)
  
    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)
  
    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)
  
    ;; Configure other variables and modes in the :config section,
    ;; after lazily loading the package.
    :config
  
    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key (kbd "M-."))
    ;; (setq consult-preview-key (list (kbd "<S-down>") (kbd "<S-up>")))
    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    (consult-customize
     consult-ripgrep consult-git-grep consult-grep consult-bookmark consult-recent-file
     consult--source-file consult--source-project-file consult--source-bookmark
     :preview-key (kbd "M-."))
  
    ;; Optionally configure the narrowing key.
    ;; Both < and C-+ work reasonably well.
    (setq consult-narrow-key "<") ;; (kbd "C-+")
  
    ;; Optionally make narrowing help available in the minibuffer.
    ;; You may want to use `embark-prefix-help-command' or which-key instead.
    ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)
  
    ;; Optionally configure a function which returns the project root directory.
    ;; There are multiple reasonable alternatives to chose from.
    ;;;; 1. project.el (project-roots)
    (setq consult-project-root-function
          (lambda ()
            (when-let (project (project-current))
              (car (project-roots project)))))
    ;;;; 2. projectile.el (projectile-project-root)
    ;; (autoload 'projectile-project-root "projectile")
    ;; (setq consult-project-root-function #'projectile-project-root)
    ;;;; 3. vc.el (vc-root-dir)
    ;; (setq consult-project-root-function #'vc-root-dir)
    ;;;; 4. locate-dominating-file
    ;; (setq consult-project-root-function (lambda () (locate-dominating-file "." ".git")))
    )
  
#+end_src

** Org Mode

=Org mode= is what makes Emacs most special; it's what drove me to Emacs and convinced me to stay. I discovered Emacs while reading [[https://gettingthingsdone.com/][Getting Things Done]] and both seemed to work really great together. Org comes with many different modules and functions, but works even better with some basic configuration.

