System.org
*** Org UI

First, let's define a function for better fonts in =org files=. Make sure =Cantarell= fonts are installed.

#+begin_src emacs-lisp
  
  (defun mb/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  
    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))
  
    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))
  
#+end_src

Next, set up a function for org-mode hook. This makes sure:
- the buffer is displayed in the indented view
- we get /proportional fonts/ in the buffer, makes it nicer to look at
- /word-wrap/ is turned on and editing commands act on visual lines, not logical lines
- enable visual-fill

#+begin_src emacs-lisp
  
  (defun mb/org-mode-visual-fill ()
    (setq visual-fill-column-width 120
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))
  
  (use-package visual-fill-column
    :defer t)
  
  (defun mb/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1)
    (mb/org-mode-visual-fill))
  
#+end_src

*** Configuration

Here, we start the actual configuration. The first part of the config sets-up various things, such as:

- A nicer symbol to show there is hidden content
- Hide emphasis markers so we see *bold* instead of **bold**
- Make sure at startup content is =folded=
- Extra =evil= key definitions

#+begin_src emacs-lisp
  
  (straight-use-package '(org :type built-in))
  
  (use-package org
    :defer t
    :hook (org-mode . mb/org-mode-setup)
    :config
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers t
          org-src-fontify-natively t
          org-fontify-quote-and-verse-blocks t
          org-src-tab-acts-natively t
          org-edit-src-content-indentation 2
          org-hide-block-startup nil
          org-src-preserve-indentation nil
          org-startup-folded 'content
          org-cycle-separator-lines 2)
  
    (evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'org-next-visible-heading)
    (evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'org-previous-visible-heading)
  
    (evil-define-key '(normal insert visual) org-mode-map (kbd "M-j") 'org-metadown)
    (evil-define-key '(normal insert visual) org-mode-map (kbd "M-k") 'org-metaup)
  
#+end_src

*NOTE* This is not the /end/ of our =use-package= block!

*** *NOTE* TESTING NEW WORKFLOW

So, the next few items have been disabled for now.

**** File paths

In this part I set some default paths.

#+begin_src emacs-lisp :tangle no
  
  (setq org-directory "~/Documents/org"
        org-roam-directory "~/Documents/org/notes"
        org-default-notes-file "~/Documents/org/notes/main.org"
        org-agenda-files '( "~/Documents/org/calendar/personal.org"
                            "~/Documents/org/calendar/family.org"
                            "~/Documents/org/gtd/inbox.org"))
  
#+end_src

**** Workflow states

In our workflow part of this configuration, I set up my =TODO= keywords. You can add multiple =keyword sequences= to the list. I use one for my default workflow and one for my book log.

=!= means to add a time
=@= ask for note

Furthermore, it's nice to have the keywords visually emphasized using different colours.

#+begin_src emacs-lisp :tangle no
  
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "WAITING(w@/!)" "CANCELLED(c@/!" "|" "DONE(d!)")
          (sequence "PLANNED(p)" "READING(r)" "|" "DONE(d!)" "CANC(k@")))
  
  (setq org-todo-keyword-faces
        '(("NEXT"      . (:foreground "orange red"    :weight bold))
          ("TODO"      . (:foreground "orange red"    :weight bold))
          ("WAITING"   . (:foreground "HotPink2"      :weight bold))
          ("CANCELLED" . (:foreground "red"           :weight bold))
          ("DONE"      . (:foreground "MediumPurple3" :weight bold))))
  
#+end_src

**** Tags

Tags are nice to quickly filter out certain actions.

#+begin_src emacs-lisp :tangle no
  
  (setq org-tag-alist
        '(("@COMPUTER" . ?C)
          ("@HOME"     . ?H)
          ("@WORK"     . ?W)
          ("@PHONE"    . ?t)
          ("project"   . ?p)
          ("habit"     . ?h)
          ("idea"      . ?i)))
#+end_src

**** Agenda

With =org agenda= you can [[https://orgmode.org/manual/Agenda-Views.html#Agenda-Views][customize]] your whole agenda look, but for now I keep it simple. In the future, I'd like to dive into [[https://github.com/alphapapa/org-super-agenda][org-super-agenda]].

#+begin_src emacs-lisp :tangle no
  
  ;; Configure custom agenda views
  (setq org-agenda-custom-commands
        '(("d" "Dashboard"
           ((agenda "" ((org-deadline-warning-days 7)))
            (todo "NEXT"
                  ((org-agenda-overriding-header "Next Tasks")))
            (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))
  
          ("n" "Next Tasks"
           ((todo "NEXT"
                  ((org-agenda-overriding-header "Next Tasks")))))))
  
#+end_src

**** Capture templates

=Org-capture= make it very easy to quickly store notes and other things. It has [[https://orgmode.org/manual/Capture.html#Capture][way too many possibilities to remember]], but below are a couple of useful templates. I still have some cleaning-up to do.

#+begin_src emacs-lisp :tangle no
  
  (setq org-capture-templates
        `(("t" "Tasks / Projects")
          ("tn" "Next Item" entry
           (file+olp "~/Documents/org/gtd/inbox.org" "Tasks")
           "* NEXT %?\n  %U\n  %a\n  %i" :empty-lines 1)
          ("tt" "TODO" entry
           (file+olp "~/Documents/org/gtd/inbox.org" "Tasks")
           "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
          ("tp" "Project" entry
           (file+headline "~/Documents/org/gtd/projects.org" "PROJECTEN")
           "* PROJ %?\n %U\n %i" :empty-lines 1)
  
          ("w" "Review: Weekly Review" entry (file+datetree "~/Documents/org/gtd/reviews.org")
           (file "~/Documents/org/templates/weeklyreviewtemplate.org")
           :immediate-finish :jump-to-captured)
  
          ("m" "Metrics Capture / Sports")
          ("mc" "Fietsen" table-line
           (file+headline "~/Documents/org/gtd/metrics.org" "Cycling")
           "| %U | %^{Distance} | %^{Avg speed} | %^{Duration} | %^{Avg heartrate} | %^{Notes} |" :kill-buffer t)
          ("mr" "Hardlopen" table-line
           (file+headline "~/Documents/org/gtd/metrics.org" "Running"))
          ("mw" "Weight" table-line
           (file+headline "~/Documents/org/gtd/metrics.org" "Weight")
           "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)
  
          ("e" "Email Workflow")
          ("ee" "Checking Email" entry
           (file+olp+datetree "~/Documents/org/gtd/journal.org")
           "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)
          ("ef" "Follow Up" entry (file+headline "~/Documents/org/gtd/mail.org" "Follow-up")
           "* TODO Follow up with %:fromname on %:subject\n%a\n\n%i")
          ("er" "Read Later" entry (file+headline "~/Documents/org/gtd/mail.org" "Read Later")
           "* TODO Read %:subject\n%a\n\n%i")
  
          ("h" "Hobbies")
          ("hb" "Book entry" entry (file+headline "~/Documents/org/gtd/books.org" "2021")
           "* %^{prompt|TODO|READING|DONE} %^{Title}\n:PROPERTIES:\n:author: %?\n:END:\n" :prepend t :empty-lines-after 1)))
  
#+end_src

**** *New Workflow*

#+begin_src emacs-lisp
  
  (require 'mb-workflow)
  
#+end_src

*** Modules

Enable some modules which are quite handy, such as =habits=

#+begin_src emacs-lisp
  
  (setq org-modules
        '(org-habit
          org-bookmark
          org-eshell))
  
#+end_src

*** Babel

=Babel= is amazing! It /tangles/ all source code blocks into a different document, but can do so much more. I just have to set it up for my languages. It's easy to add [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][languages]].

#+begin_src emacs-lisp
  
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))
  
  (push '("conf-unix" . conf-unix) org-src-lang-modes)
  (push '("nix" . nix) org-src-lang-modes)
  
#+end_src

*** Block Templates

These templates enable you to type things like =<el= and then hit =Tab= to expand
the template. More documentation can be found at the Org Mode [[https://orgmode.org/manual/Easy-templates.html][Easy Templates]]
documentation page.

#+begin_src emacs-lisp

  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("r"  . "src rust"))

#+end_src

*** Org Bullets using Superstar

The default heading stars are not very visually attractive. I replace this with [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] and define a custom bullet list.

#+begin_src emacs-lisp

  (use-package org-superstar
    :straight t
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

*** Archiving Made Easier - Function

Add a little function that makes it easier to archive all =DONE= items in a subtree (without archiving the entire subtree). See: [[https://stackoverflow.com/questions/6997387/how-to-archive-all-the-done-tasks-using-a-single-command][stackoverflow]]

#+begin_src emacs-lisp
  
  (defun org-archive-done-tasks ()
    (interactive)
    (org-map-entries
     (lambda ()
       (org-archive-subtree)
       (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
     "/DONE" 'tree))
  
#+end_src

*** Update Table of Contents on Save

It's nice to have a table of contents section for long literate configuration files (like this one!) so I use =org-make-toc= to automatically update the ToC in any header with a property named =TOC=.

#+begin_src emacs-lisp
  
  (use-package org-make-toc
    :hook (org-mode . org-make-toc-mode))
  
#+end_src

*** End of =use-package org=

And finally, load our font setup (see function at the beginning of this org block) and end our =use-package org= block with a parenthesis.

#+begin_src emacs-lisp
  
  (mb/org-font-setup))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-org
  org
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  org-bullets
    org-appear
    evil-org
    org-make-toc
    deft
    org-re-reveal
    visual-fill-column
#+end_src

