System.org
** Org Journal

It is my intention to use a journal to indicate how my day was, how I was feeling, whether I was tired and more. This should be a habit I suppose. [[https://github.com/bastibe/org-journal][Org-journal]] might be a useful package for this, so I'll try using it with a very basic configuration.

#+begin_src emacs-lisp
  
  (use-package org-journal
    :defer t
    :config
    (setq org-journal-dir "~/Documents/org/journals/"
          org-journal-date-format "%A, %d %B %Y"
          org-journal-file-type 'weekly))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  org-journal
#+end_src

** Sync Google Calendar

I mainly use Google Calendar (one of my last Google apps), and I would like to show my appointments in Org calendar. For this, I've used =org-gcal=, but had some problems with it. So, now I'll try [[https://github.com/dengste/org-caldav][org-caldav]].

*NOTE* I have to defer this for 2 minutes, because somehow =:after= does not work.

#+begin_src emacs-lisp
  
  (use-package oauth2) ;; needed for Caldav
  
  (use-package org-caldav
    :defer 120 ;; Wait 2 minutes!
    :config
    (setq org-caldav-oauth2-client-id (password-store-get "API/Google/gcal-client-id"))
    (setq org-caldav-oauth2-client-secret (password-store-get "API/Google/gcal-client-secret"))
    (setq org-caldav-url 'google)
    (setq org-caldav-calendars
          '((:calendar-id "mbroeders@gmail.com"
                          :files ("~/Documents/org/gtd/inbox.org")   ;; Files needed to sync TO Google Calendar
                          :inbox "~/Documents/org/calendar/personal.org")    ;; Here go all the new entries
            (:calendar-id "family08361847864604318057@group.calendar.google.com"
                          :files ()
                          ;; :skip-conditions (regexp "soccer")
                          :inbox "~/Documents/org/calendar/family.org"))
          )
    (setq org-icalendar-timezone "Europe/Amsterdam")
    (setq org-caldav-save-directory "~/Documents/org/calendar/")
    (setq plstore-cache-passphrase-for-symmetric-encryption t))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  org-caldav
    oauth2-request
#+end_src

** Presentations with =org-re-reveal=

I recently discovered [[https://github.com/emacsmirror/org-re-reveal][org-re-reveal]], a package with which you can create simple, yet beautiful presentations. I'm going to try this out in my next presentations. For now, I don't really set custom variables, but to make sure Emacs loads the library, I'll add a =require= block.

#+begin_src emacs-lisp

  (require 'org-re-reveal)

#+end_src


** Useful Packages and Apps
*** App Launcher

#+begin_src emacs-lisp
  
  (use-package app-launcher
    :straight '(app-launcher :host github :repo "SebastienWae/app-launcher"))
  
#+end_src

*** Deft (note taking)

[[https://jblevins.org/projects/deft/][deft]] is an Emacs mode for quickly browsing, filtering, and editing directories of plain text notes.

#+begin_src emacs-lisp
  
  (use-package deft
    :commands (deft)
    :config (setq deft-directory "~/Documents/org/notes"
                  deft-default-extension "org"
                  deft-extensions '("md" "org")))
  
#+end_src

*** ERC (chat)

So, although I come from the 80's and have used =msm= in the past, I never really used chat engines. But, [[https://systemcrafters.cc/][System Crafters]] made me curious about [[https://www.gnu.org/software/emacs/manual/html_mono/erc.html][ERC]] thanks to [[https://systemcrafters.cc/chatting-with-emacs/irc-basics-with-erc/][this video]]. Therefore, I copied the basic config and am going to try it out.

Some basic commands:
- =/join #CHANNEL= to join a channel, =/part= to leave
- =/list= to list all channels
- =/reconnect= to reconnect, sometimes necessary after suspend

**** Connect automatically with =C-c c=

First, let's define a function to automatically connect to a specific server. This is bound to =C-c c c=.

#+begin_src emacs-lisp
  
  (defun mb/connect-irc ()
    (interactive)
    (erc-tls
     :server "irc.libera.chat"
     :port 6697
     :nick "marbro81"
     ;; This is using password-store.el.  Not needed if you use auth-source!
     :password (password-store-get "web/libera.chat")))
  
  (global-set-key (kbd "C-c e e") 'mb/connect-irc)
  
#+end_src

**** Basic Configuration

Below are some basic settings, for instance: set my full name, hide some messages, connect automatically to some channels and more.

#+begin_src emacs-lisp
  
  (setq erc-user-full-name "Mark Broeders"  ; And this!
        erc-hide-list '("JOIN" "PART" "QUIT")
        erc-track-shorten-start 8
        erc-autojoin-channels-alist '(("irc.libera.chat" "#systemcrafters" "#emacs"))
        erc-kill-buffer-on-part t
        erc-auto-query 'bury)
  
#+end_src

**** Jumping IRC Buffers Easily

Two commands are useful for jumping to IRC buffers easily:
- erc-switch-to-buffer
- erc-track-switch-buffer (bound to =C-c C-SPC= if =erc-track-enable-keybindings= is =t=)

#+begin_src emacs-lisp
  
  (setq erc-track-enable-keybindings t)
  
#+end_src

**** Colorize Nicks

#+begin_src emacs-lisp
  
  (use-package erc-hl-nicks
    :after erc
    :config
    (add-to-list 'erc-modules 'hl-nicks))
  
#+end_src

**** Display Inline Images

#+begin_src emacs-lisp
  
  (use-package erc-image
    :after erc
    :config
    (setq erc-image-inline-rescale 300)
    (add-to-list 'erc-modules 'image))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  erc-image
    erc-hl-nicks
#+end_src

*** Expand Region

This module is absolutely necessary for working inside of Emacs Lisp files,
especially when trying to some parent of an expression (like a =setq=).  Makes
tweaking Org agenda views much less annoying.

#+begin_src emacs-lisp
  
  (use-package expand-region
    :bind (("M-[" . er/expand-region)
           ("C-(" . er/mark-outside-pairs)))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  expand-region
#+end_src

*** Helpful

[[https://github.com/Wilfred/helpful][Helpful]] is a very helpful package that aims to be an alternative for the built-in and provides much more contextual information. For instance, in addition to the basic documentation, you will also see the source code of the function and where it gets used in other places in the Emacs configuration. It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp
  
  (use-package helpful
    :config
    ;; Note that the built-in `describe-function' includes both functions
    ;; and macros. `helpful-function' is functions only, so we provide
    ;; `helpful-callable' as a drop-in replacement.
    (global-set-key (kbd "C-h f") #'helpful-callable)
  
    (global-set-key (kbd "C-h v") #'helpful-variable)
    (global-set-key (kbd "C-h k") #'helpful-key)
  
    ;; Look up *F*unctions (excludes macros).
    ;;
    ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
    ;; already links to the manual, if a function is referenced there.
    (global-set-key (kbd "C-h F") #'helpful-function)
  
    ;; Look up *C*ommands.
    ;;
    ;; By default, C-h C is bound to describe `describe-coding-system'. I
    ;; don't find this very useful, but it's frequently useful to only
    ;; look at interactive functions.
    (global-set-key (kbd "C-h C") #'helpful-command))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  helpful
#+end_src

*** Mail

My mail configuration is stored in [[file:Mail.org][Mail.org]].  We merely require it here to have it loaded in the main Emacs configuration.

#+begin_src emacs-lisp
  
  (require 'mb-mail)
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  mu4e-alert
#+end_src

*** Notifications

A basic [[https://github.com/jwiegley/alert][common notification interface]] for Emacs.

#+begin_src emacs-lisp
  
  (use-package alert
    :commands alert
    :config
    (setq alert-default-style 'notifications))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  alert
#+end_src

*** Text Scaling using Hydra

This part is completely copied from emacs-from-scratch, because I still have to figure out what [[https://github.com/abo-abo/hydra][hydra]] exactly does.

This is an example of using Hydra to design a transient key binding for quickly adjusting the scale of the text on screen. We define a hydra that is bound to =SPC t s= and, once activated, =j= and =k= increase and decrease the text scale. You can press any other key (or f specifically) to exit the transient key map.

#+begin_src emacs-lisp
  
  (use-package hydra
    :defer 1)
  
  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))
  
  (mb/leader-key-def
    "t s" '(hydra-text-scale/body :which-key "scale text"))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  hydra
#+end_src

** Terminals
*** Eshell

[[https://www.gnu.org/software/emacs/manual/html_mono/eshell.html][Eshell]] is a shell-like command interpreter written in Emacs Lisp. I find it quite handy, although I'm not yet quite sure if, for me, it replaces the more /common/ terminals.

**** Configuration

#+begin_src emacs-lisp
  
  (use-package eshell
    :init
    (setq eshell-directory-name "~/.dotfiles/.emacs.d/eshell/"
          eshell-aliases-file (expand-file-name "~/.dotfiles/.emacs.d/eshell/alias")))
  
  (mb/leader-key-def
    "SPC" 'eshell)
  
#+end_src

**** Toggling Eshell

#+begin_src emacs-lisp
  
  (use-package eshell-toggle
    :bind ("C-M-'" . eshell-toggle)
    :custom
    (eshell-toggle-size-fraction 3)
    (eshell-toggle-use-projectile-root t)
    (eshell-toggle-run-command nil))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  eshell-toggle
    eshell-syntax-highlighting
#+end_src

*** Vterm

[[https://github.com/man9ourah/vterm][Vterm]] is a handy terminal emulator with many features. In Emacs, there is a package called [[https://github.com/akermu/emacs-libvterm][emacs-libvterm]] which brings vterm to Emacs. Check github for some useful configuration options.

#+begin_src emacs-lisp
  
  (use-package vterm
    :commands vterm
    :config
    (setq vterm-max-scrollback 10000))
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  emacs-libvterm
#+end_src

** Password Management

I use =pass= for password management, all the passwords are stored on my private server. In emacs, the =password= store package can import passwords into Emacs. It's also nice to have =+pass/ivy=, this makes it easy to retrieve a password from within Emacs.

#+begin_src emacs-lisp
  (use-package password-store
    :config
    (setq password-store-password-length 12))
  
  (use-package auth-source-pass
    :config
    (auth-source-pass-enable))
  
  (mb/leader-key-def
    "a p" '(:ignore t :which-key "pass")
    "a p p" 'password-store-copy
    "a p i" 'password-store-insert
    "a p g" 'password-store-generate)
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  password-store
    # auth-source-pass
#+end_src

** System Utilities

*** Daemons

#+begin_src emacs-lisp
  
  (use-package daemons
    :commands daemons)
  
#+end_src

*Nix Packages*

#+begin_src nix :noweb-ref emacs-melpa
  daemons
#+end_src

