.emacs.d/init.el

(use-package org-journal
  :defer t
  :config
  (setq org-journal-dir "~/Documents/org/journals/"
        org-journal-date-format "%A, %d %B %Y"
        org-journal-file-type 'weekly))

(use-package oauth2) ;; needed for Caldav

(use-package org-caldav
  :defer 120 ;; Wait 2 minutes!
  :config
  (setq org-caldav-oauth2-client-id (password-store-get "API/Google/gcal-client-id"))
  (setq org-caldav-oauth2-client-secret (password-store-get "API/Google/gcal-client-secret"))
  (setq org-caldav-url 'google)
  (setq org-caldav-calendars
        '((:calendar-id "mbroeders@gmail.com"
                        :files ("~/Documents/org/gtd/inbox.org")   ;; Files needed to sync TO Google Calendar
                        :inbox "~/Documents/org/calendar/personal.org")    ;; Here go all the new entries
          (:calendar-id "family08361847864604318057@group.calendar.google.com"
                        :files ()
                        ;; :skip-conditions (regexp "soccer")
                        :inbox "~/Documents/org/calendar/family.org"))
        )
  (setq org-icalendar-timezone "Europe/Amsterdam")
  (setq org-caldav-save-directory "~/Documents/org/calendar/")
  (setq plstore-cache-passphrase-for-symmetric-encryption t))

(use-package app-launcher
  :straight '(app-launcher :host github :repo "SebastienWae/app-launcher"))

(use-package deft
  :commands (deft)
  :config (setq deft-directory "~/Documents/org/notes"
                deft-default-extension "org"
                deft-extensions '("md" "org")))

(defun mb/connect-irc ()
  (interactive)
  (erc-tls
   :server "irc.libera.chat"
   :port 6697
   :nick "marbro81"
   ;; This is using password-store.el.  Not needed if you use auth-source!
   :password (password-store-get "web/libera.chat")))

(global-set-key (kbd "C-c e e") 'mb/connect-irc)

(setq erc-user-full-name "Mark Broeders"  ; And this!
      erc-hide-list '("JOIN" "PART" "QUIT")
      erc-track-shorten-start 8
      erc-autojoin-channels-alist '(("irc.libera.chat" "#systemcrafters" "#emacs"))
      erc-kill-buffer-on-part t
      erc-auto-query 'bury)

(setq erc-track-enable-keybindings t)

(use-package erc-hl-nicks
  :after erc
  :config
  (add-to-list 'erc-modules 'hl-nicks))

(use-package erc-image
  :after erc
  :config
  (setq erc-image-inline-rescale 300)
  (add-to-list 'erc-modules 'image))

(use-package expand-region
  :bind (("M-[" . er/expand-region)
         ("C-(" . er/mark-outside-pairs)))

(use-package helpful
  :config
  ;; Note that the built-in `describe-function' includes both functions
  ;; and macros. `helpful-function' is functions only, so we provide
  ;; `helpful-callable' as a drop-in replacement.
  (global-set-key (kbd "C-h f") #'helpful-callable)

  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)

  ;; Look up *F*unctions (excludes macros).
  ;;
  ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
  ;; already links to the manual, if a function is referenced there.
  (global-set-key (kbd "C-h F") #'helpful-function)

  ;; Look up *C*ommands.
  ;;
  ;; By default, C-h C is bound to describe `describe-coding-system'. I
  ;; don't find this very useful, but it's frequently useful to only
  ;; look at interactive functions.
  (global-set-key (kbd "C-h C") #'helpful-command))

(require 'mb-mail)

(use-package alert
  :commands alert
  :config
  (setq alert-default-style 'notifications))

(use-package hydra
  :defer 1)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(mb/leader-key-def
  "t s" '(hydra-text-scale/body :which-key "scale text"))

(use-package eshell
  :init
  (setq eshell-directory-name "~/.dotfiles/.emacs.d/eshell/"
        eshell-aliases-file (expand-file-name "~/.dotfiles/.emacs.d/eshell/alias")))

(mb/leader-key-def
  "SPC" 'eshell)

(use-package eshell-toggle
  :bind ("C-M-'" . eshell-toggle)
  :custom
  (eshell-toggle-size-fraction 3)
  (eshell-toggle-use-projectile-root t)
  (eshell-toggle-run-command nil))

(use-package vterm
  :commands vterm
  :config
  (setq vterm-max-scrollback 10000))

(use-package password-store
  :config
  (setq password-store-password-length 12))

(use-package auth-source-pass
  :config
  (auth-source-pass-enable))

(mb/leader-key-def
  "a p" '(:ignore t :which-key "pass")
  "a p p" 'password-store-copy
  "a p i" 'password-store-insert
  "a p g" 'password-store-generate)

(use-package daemons
  :commands daemons)
